In [233]:
import pandas as pd

In [234]:
import numpy as np

In [235]:
df = pd.read_excel (r'/Users/faaizahdesai/Desktop/me2010.xlsx', sheet_name = '2010')

In [236]:
df2 = pd.read_excel (r'/Users/faaizahdesai/Desktop/them2010.xlsx', sheet_name = '2010')

In [237]:
pd.set_option("display.max_rows", None, "display.max_columns", None)

In [238]:
df_ss1 = df.sort_values(by = ['State','School']).reset_index()

In [239]:
df_ss1.head()

,index,State,School,#Full-Time Applicants,#Part-Time Applicants,# of Offers,# of Matriculants
0,0,Alabama,Alabama,1276.0,0.0,424,154
1,1,Alabama,Faulkner,589.0,0.0,323,126
2,2,Alabama,Samford,1105.0,0.0,519,162
3,3,Arizona,Arizona,2242.0,0.0,756,160
4,4,Arizona,Arizona State,2736.0,0.0,757,181

In [240]:
df_ss2 = df2.sort_values(by = ['State','School']).reset_index()

In [241]:
df_ss2.head()

,index,State,School,# Full-Time Applicants,# Part-Time Applicants,# of Offers,# of Matriculants
0,0,Alabama,Alabama,1276.0,0.0,424,154
1,1,Alabama,Faulkner,589.0,0.0,323,126
2,2,Alabama,Samford,1105.0,0.0,519,162
3,3,Arizona,Arizona,2242.0,0.0,756,160
4,4,Arizona,Arizona State,2736.0,0.0,757,181

In [242]:
df_ss2.to_csv('df_ss2.csv')

In [243]:
df_ss1.to_csv('df_ss1.csv')

In [244]:
df_ss1['State2']=df_ss2['State']

In [245]:
df_ss1['School2']=df_ss2['School']

In [246]:
df_ss1['# Full-Time Applicants2']=df_ss2['# Full-Time Applicants']

In [247]:
df_ss1['# Part-Time Applicants2']=df_ss2['# Part-Time Applicants']

In [248]:
df_ss1['# of Offers2']=df_ss2['# of Offers']

In [249]:
df_ss1['# of Matriculants2']=df_ss2['# of Matriculants']

In [250]:
df_ss1.head()

,index,State,School,#Full-Time Applicants,#Part-Time Applicants,# of Offers,# of Matriculants,State2,School2,# Full-Time Applicants2,# Part-Time Applicants2,# of Offers2,# of Matriculants2
0,0,Alabama,Alabama,1276.0,0.0,424,154,Alabama,Alabama,1276.0,0.0,424,154
1,1,Alabama,Faulkner,589.0,0.0,323,126,Alabama,Faulkner,589.0,0.0,323,126
2,2,Alabama,Samford,1105.0,0.0,519,162,Alabama,Samford,1105.0,0.0,519,162
3,3,Arizona,Arizona,2242.0,0.0,756,160,Arizona,Arizona,2242.0,0.0,756,160
4,4,Arizona,Arizona State,2736.0,0.0,757,181,Arizona,Arizona State,2736.0,0.0,757,181

In [251]:
(df_ss1[df_ss1['School']!=df_ss1['School2']])

Empty DataFrame
Columns: [index, State, School, #Full-Time Applicants, #Part-Time Applicants, # of Offers, # of Matriculants, State2, School2, # Full-Time Applicants2, # Part-Time Applicants2, # of Offers2, # of Matriculants2]
Index: []

In [252]:
(df_ss1[df_ss1['#Full-Time Applicants']!=df_ss1['# Full-Time Applicants2']])

,index,State,School,#Full-Time Applicants,#Part-Time Applicants,# of Offers,# of Matriculants,State2,School2,# Full-Time Applicants2,# Part-Time Applicants2,# of Offers2,# of Matriculants2
37,37,District of Columbia,George Washington,NaN,NaN,2087,517,District of Columbia,George Washington,NaN,NaN,2087,517

In [253]:
(df_ss1[df_ss1['#Part-Time Applicants']!=df_ss1['# Part-Time Applicants2']])

,index,State,School,#Full-Time Applicants,#Part-Time Applicants,# of Offers,# of Matriculants,State2,School2,# Full-Time Applicants2,# Part-Time Applicants2,# of Offers2,# of Matriculants2
37,37,District of Columbia,George Washington,NaN,NaN,2087,517,District of Columbia,George Washington,NaN,NaN,2087,517

In [254]:
(df_ss1[df_ss1['# of Offers']!=df_ss1['# of Offers2']])

Empty DataFrame
Columns: [index, State, School, #Full-Time Applicants, #Part-Time Applicants, # of Offers, # of Matriculants, State2, School2, # Full-Time Applicants2, # Part-Time Applicants2, # of Offers2, # of Matriculants2]
Index: []

In [255]:
(df_ss1[df_ss1['# of Matriculants']!=df_ss1['# of Matriculants2']])

Empty DataFrame
Columns: [index, State, School, #Full-Time Applicants, #Part-Time Applicants, # of Offers, # of Matriculants, State2, School2, # Full-Time Applicants2, # Part-Time Applicants2, # of Offers2, # of Matriculants2]
Index: []